Функция ПолучитьСертификатAPNs(ВидСертификата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_APNsСертификаты.Сертификат КАК Сертификат
	|ИЗ
	|	РегистрСведений.ns_APNsСертификаты КАК ns_APNsСертификаты
	|ГДЕ
	|	ns_APNsСертификаты.ВидСертификата = &ВидСертификата";
	Запрос.УстановитьПараметр("ВидСертификата", ВидСертификата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Сертификат.Получить();
КонецФункции
 