#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураQR = Новый Структура;
	СтруктураQR.Вставить("FCMServerKey", Константы.nsFCMКлючCервера.Получить());
	СтруктураQR.Вставить("FCMSenderID", Константы.nsFCMИдентификаторОтправителя.Получить());
	
	ДанныеQR = nsОбщегоНазначения.ЗаписатьДанныеВJSON(СтруктураQR);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ШК = СформироватьQRCodeСервер();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьQRCodeСервер()
	ДанныеQRКода = ДанныеQRКода(ДанныеQR, 1, 190);
	Возврат ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер)
	
	Отказ = Ложь;
	
	ГенераторQRКода = КомпонентаФормированияQRКода(Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеКартинки = ГенераторQRКода.GenerateQRCode(QRСтрока, УровеньКоррекции, Размер);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование QR-кода'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ДвоичныеДанныеКартинки;
КонецФункции

&НаСервере
Функция КомпонентаФормированияQRКода(Отказ)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Платформа = СистемнаяИнформация.ТипПлатформы;
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации QR-кода'");
	
	Попытка
		Если ПодключитьВнешнююКомпоненту("ОбщийМакет.nsКомпонентаПечатиQRКода", "QR") Тогда
			QRCodeGenerator = Новый("AddIn.QR.QRCodeExtension");
		Иначе
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование QR-кода'", Метаданные.ОсновнойЯзык.КодЯзыка),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Отказ = Истина;	
		КонецЕсли
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование QR-кода'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;	
	КонецПопытки;
	
	Возврат QRCodeGenerator;
КонецФункции

#КонецОбласти 
  


